==================
simple assignment
==================
key=value
---
(source_file
  (variable
    name: (identifier)
    value: (raw_value)))

==================
empty value
==================
key=
---
(source_file
  (variable
    name: (identifier)))

==================
assignment with spaces
==================
key = value
---
(source_file
  (variable
    name: (identifier)
    value: (raw_value)))

==================
multiple variables
==================
KEY1=value1
KEY2=value2
---
(source_file
  (variable
    name: (identifier)
    value: (raw_value))
  (variable
    name: (identifier)
    value: (raw_value)))